{"maximumSentences":7,"searchTerm":"PaulWalker","prefix":"Who is","sourceContentOriginal":"Paul William Walker IV (September 12, 1973 – November 30, 2013) was an American actor. He is best known for his role as Brian O'Conner in the Fast & Furious franchise.\nWalker began his career as a child actor during the 1970s and 1980s, gaining recognition in the early 1990s after appearing in the television soap opera The Young and the Restless; he received praise for his performances in the teen film She's All That and the coming-of-age film Varsity Blues (both 1999), before gaining international fame after starring in The Fast and the Furious (2001).\nWalker then starred in the commercially successful road thriller Joy Ride (2001), which led to a reputation as an action star. He then continued with his performances in box-office disappointments Into the Blue (2005) and Running Scared (2006). Walker also earned praise in other genres, like in the survival drama Eight Below, and for his portrayal of Hank Hansen the war film Flags of Our Fathers (both 2006). Outside of these, Walker then largely appeared in low budget action films, but starred in the commercially successful heist film Takers (2010).\nWalker died on November 30th, 2013 at the age of 40 as a passenger in a single-car crash alongside friend and driver Roger Rodas. The accident is thought to be caused by driving into a gas pipe. Walker's father and daughter filed separate wrongful death lawsuits against Porsche, which resulted in settlements. At the time of his death, Walker had not completed filming Furious 7 (2015), which then was completed after rewrites and stand-ins, including his brothers Cody and Caleb, filling in for Walker. The song \"See You Again\" by Wiz Khalifa and Charlie Puth was commissioned for the film's soundtrack as a tribute to Walker.\n\n\n== Early life ==\nWalker was born on September 12, 1973, in Glendale, California, to American parents with mostly English, as well as German, Swiss, and Irish ancestry. His mother, Cheryl (née Crabtree), was a fashion model, and his father, Paul William Walker III, was a sewer contractor and former amateur boxer, who was a two-time Golden Gloves champion. Walker's paternal grandfather, William, had a short-lived boxing career as \"Irish\" Billy Walker, while another raced factory cars for Ford in the 1960s.Raised a Mormon, Walker had four younger siblings: Aimee, Ashlie, Caleb, and Cody. He spent the majority of his early life in the Sunland neighborhood of Los Angeles, and graduated from Village Christian School in 1991. Walker subsequently attended several community colleges in Southern California, majoring in marine biology.\n\n\n== Career ==\nWalker began a modelling career as a toddler, starring in a television commercial for Pampers at age two. He continued to appear in commercials, most notably for Showbiz Pizza in 1984, before beginning an acting career on television that year, appearing in the teen anthology series CBS Schoolbreak Special. Walker continued to work in television until 1996, across a number of genres; he appeared in two episodes of the fantasy drama Highway to Heaven between 1984 and 1986, and secured his first leading role in 1987, appearing as Jeremy Beatty in the sitcom Throb. He continued to feature on sitcoms in the early 1990s, with guest roles in Charles in Charge, Who's the Boss?, and the short-lived What a Dummy. In 1993, he portrayed Brandon Collins on the soap opera The Young and the Restless; he and co-star Heather Tom, who played Victoria Newman, gained fame, and were nominated for Outstanding Lead Actor and Actress in a Soap Opera at the Youth in Film Awards. Walker's final television role was on Touched by an Angel, although appeared as himself, alongside his sister Ashlie, as contestants on a 1988 episode of the game show I'm Telling!, in which they finished in second place.\nWalker began his film career in 1986, appearing mainly in low budget B films. His first role was in the horror comedy Monster in the Closet, and a year later, starred The Retaliator (retroactively subtitled Programmed to Kill), a science fiction film. In 1994, he returned to film, starring in Tammy and the T-Rex, but secured his first feature film role in the comedy Meet the Deedles in 1998; although commercially and critically unsuccessful, it allowed Walker to secure supporting roles in the films Pleasantville (1998), Varsity Blues (1999), She's All That (1999), and The Skulls (2000).\n\nIn 2001, Walker's breakthrough role arrived when he starred opposite Vin Diesel in the action film The Fast and the Furious; it was commercially successful, and subsequently launched a media franchise. The film also established Walker as a film star and leading man, as his performance garnered the MTV Movie Award for Best On-Screen Team (shared with Diesel) in 2002. Walker then reprised his role as Brian O'Conner in the 2003 sequel 2 Fast 2 Furious, and also starred in the critically successful thriller Joy Ride (2001). After this, Walker starred mainly in either low-budget or commercially unsuccessful films, notably Timeline (2003) and Into the Blue (2005).\n\nWalker had a supporting role, portraying Hank Hansen Clint Eastwood's war film Flags of Our Fathers (2006), and starred in the survival drama Eight Below, both released in 2006. Eight Below garnered critical acclaim and opened in first place at the box office, grossing over US$20 million during its opening weekend. Walker then starred in the independent film The Lazarus Project, which was released on DVD on October 21, 2008.\nDespite initial reluctance, Walker reprised his role as Brian O'Conner after seven years, in Fast & Furious (2009). The film became the highest-grossing film in the franchise up until that point. He reprised his role in the fifth and sixth installments of the franchise, which were commercially successful, while his performances were praised. Walker was nominated for Choice Movie Actor – Action at the 2011 Teen Choice Awards for the former, and nominated for Choice Movie: Chemistry (with Diesel and Dwayne Johnson) and won his second MTV Movie Award for Best On-Screen Duo with Diesel for the latter. Walker also starred in the heist film Takers (2010), and returned to modelling in 2011, appearing as the face of fragrance brand Cool Water. In 2012, he founded the film production company Laguna Ridge Pictures, which signed a first-look deal with Fast & Furious distributor Universal Pictures.After his death in 2013, four films starring Walker were released; the thriller film Hours (2013), the action film Brick Mansions (2014), itself a remake of the French film District 13 (2004). He also acted as executive producer on the film Pawn Shop Chronicles (2013), while Furious 7, originally slated for release in 2014, was pushed back to recreate Walker's likeness. The filmmakers hired Peter Jackson's Weta Digital visual effects house to complete this, using existing reference materials, Walker's brothers Caleb and Cody, as well as actor John Brotherton, as stand-ins, and outtakes or older footage, to create an accurate remodel of Walker's face. The film was then released in 2015, and Walker won the award for Choice Movie Actor: Action at the 2015 Teen Choice Awards, and was nominated for Choice Movie: Chemistry (shared with Diesel, Johnson, Michelle Rodriguez, Tyrese Gibson, and Ludacris).\nWalker was also set to play Agent 47 in the film adaptation Hitman: Agent 47 (2015), but died before production began. It was later revealed Walker declined the role of Superman in Superman Returns (2006), allegedly due to the Superman curse and the celebrity associated with the role.\n\n\n== Personal life ==\nWalker was raised in a Mormon household, but later became a non-denominational Christian. He lived in Santa Barbara with his dogs. He and Rebecca Soteros, a one-time girlfriend, had a daughter named Meadow Rain Walker, who lived with her mother in Hawaii for 13 years and then moved to California to live with Walker in 2011. Her godfather is Vin Diesel, with whom Walker shared a close bond; Diesel gave him the nickname \"Pablo\", while Walker's mother referred to her son as Diesel's \"other half\". Walker was also close friends with fellow Fast & Furious co-star Tyrese Gibson. At the time of his death, Walker was dating Jasmine Pilchard-Gosnell.He held a brown belt in Brazilian jiu-jitsu under Ricardo \"Franjinha\" Miller at Paragon Jiu-Jitsu and was awarded his black belt by Miller posthumously. Walker founded the humanitarian aid nonprofit charity Reach Out Worldwide (ROWW) with financial adviser Roger Rodas in response to the 2010 Haiti earthquake. He traveled to a number of disaster-stricken areas to supply aid until his death.\n\nWalker had an interest in marine biology, and joined the board of directors of The Billfish Foundation in 2006. He fulfilled a lifelong dream by starring in the National Geographic Channel series Expedition Great White (retroactively retitled Shark Men), which premiered in June 2010. Walker spent 11 days catching and tagging seven great white sharks off the coast of Mexico. The expedition, led by Chris Fischer, founder and CEO of Fischer Productions, and Brett McBride and Michael Domeier of the Marine Conservation Science Institute, took measurements, gathered DNA samples, and fastened real-time satellite tags to the great white sharks, in order to study migratory patterns, especially those associated with mating and birthing, over a five-year period.A car enthusiast, Walker competed in the Redline Time Attack racing series in which he raced on the AE Performance Team driving a BMW E92 M3. His car was sponsored by Etnies, Brembo Brakes, Öhlins, Volk, OS Giken, Hankook, Gintani, and Reach Out Worldwide. Walker had been preparing for an auto show prior to his death. Walker owned Always Evolving, a Valencia high-end vehicle performance shop, where Rodas, a pro-am racer, acted as CEO.Walker also had a large car collection of about 30 cars, a portion of which he co-owned along with Rodas. The collection included (but is not limited to):\n\nIn January 2020, twenty-one vehicles owned by Walker were sold for a combined $2.33 million during spirited bidding at an annual car auction in Arizona.\n\n\n== Death ==\n\nOn November 30, 2013, at about 3:30 p.m. PST, Walker, 40, and Roger Rodas, 38, left an event for Walker's charity Reach Out Worldwide for victims of Typhoon Haiyan (Yolanda), with Rodas driving his 2005 Porsche Carrera GT. In a 45 mph (72 km/h) speed zone on Hercules Street near Kelly Johnson Parkway in Valencia, Santa Clarita, California, the car crashed into a concrete lamp post and two trees subsequently catching fire to the vehicle. Rodas died of multiple trauma while Walker died from the combined effects of trauma and burns. Both of their bodies were burned beyond recognition.The curve where Walker and Rodas died is a popular spot for drifting cars. No alcohol or other drugs were found in either man's system, and neither mechanical failure nor road conditions appeared to play a role. Police found no evidence of drag racing. The investigation concluded that the car's speed – between 80 mph (130 km/h) and 93 mph (150 km/h) – and age of the tires were the primary reasons for the crash.\n\nWith Furious 7 in the middle of filming at the time of Walker's death, Universal announced an indeterminate hiatus on the production, citing a desire to speak with his family before determining what to do with the film.Numerous friends and movie stars posted tributes to Walker on social media. His body was cremated and his ashes were buried in a non-denominational ceremony at Forest Lawn Memorial Park. His life was later chronicled in the documentary I Am Paul Walker, which was released on August 11, 2018.\n\n\n=== Legal repercussions ===\nIn December 2014, Walker's father filed a wrongful death claim against Rodas' estate seeking the return of or \"a proportionate share\" of revenue generated by a group of automobiles that were jointly owned by both Walker and Rodas. In September 2015, Walker's daughter filed a wrongful death lawsuit against Porsche, claiming that the Porsche Carrera GT had numerous design defects including a history of instability, and that its seat belt placement can cause harm upon impact. However, Porsche denied any wrongdoing and blamed Walker, stating: \"The perils, risk, and danger were open and obvious and known to him, and he chose to conduct himself in a manner so as to expose himself to such perils, dangers, and risks, thus assuming all the risks involved in using the vehicle.\"In April 2016, U.S. District Court Judge Philip S. Gutierrez ruled in favor of Porsche in a separate lawsuit filed by Rodas' widow Kristine. The ruling had no bearing on two other cases against Porsche which have been filed by Walker's father, who is also the executor of the actor's estate, and his daughter. Walker's father and daughter both reached separate out-of-court settlements with Porsche.\n\n\n== Filmography ==\n\n\n== Awards and nominations ==\n\n\n== References ==\n\n\n== External links ==\nPaul Walker at IMDb\nPaul Walker at AllMovie","sourceContentOriginaSanitized":"Paul William Walker IV was an American actor. He is best known for his role as Brian O'Conner in the Fast & Furious franchise. Walker began his career as a child actor during the 1970s and 1980s, gaining recognition in the early 1990s after appearing in the television soap opera The Young and the Restless; he received praise for his performances in the teen film She's All That and the coming-of-age film Varsity Blues , before gaining international fame after starring in The Fast and the Furious . Walker then starred in the commercially successful road thriller Joy Ride , which led to a reputation as an action star. He then continued with his performances in box-office disappointments Into the Blue and Running Scared . Walker also earned praise in other genres, like in the survival drama Eight Below, and for his portrayal of Hank Hansen the war film Flags of Our Fathers . Outside of these, Walker then largely appeared in low budget action films, but starred in the commercially successful heist film Takers . Walker died on November 30th, 2013 at the age of 40 as a passenger in a single-car crash alongside friend and driver Roger Rodas. The accident is thought to be caused by driving into a gas pipe. Walker's father and daughter filed separate wrongful death lawsuits against Porsche, which resulted in settlements. At the time of his death, Walker had not completed filming Furious 7 , which then was completed after rewrites and stand-ins, including his brothers Cody and Caleb, filling in for Walker. The song \"See You Again\" by Wiz Khalifa and Charlie Puth was commissioned for the film's soundtrack as a tribute to Walker. Walker was born on September 12, 1973, in Glendale, California, to American parents with mostly English, as well as German, Swiss, and Irish ancestry. His mother, Cheryl , was a fashion model, and his father, Paul William Walker III, was a sewer contractor and former amateur boxer, who was a two-time Golden Gloves champion. Walker's paternal grandfather, William, had a short-lived boxing career as \"Irish\" Billy Walker, while another raced factory cars for Ford in the 1960s.Raised a Mormon, Walker had four younger siblings: Aimee, Ashlie, Caleb, and Cody. He spent the majority of his early life in the Sunland neighborhood of Los Angeles, and graduated from Village Christian School in 1991. Walker subsequently attended several community colleges in Southern California, majoring in marine biology. Walker began a modelling career as a toddler, starring in a television commercial for Pampers at age two. He continued to appear in commercials, most notably for Showbiz Pizza in 1984, before beginning an acting career on television that year, appearing in the teen anthology series CBS Schoolbreak Special. Walker continued to work in television until 1996, across a number of genres; he appeared in two episodes of the fantasy drama Highway to Heaven between 1984 and 1986, and secured his first leading role in 1987, appearing as Jeremy Beatty in the sitcom Throb. He continued to feature on sitcoms in the early 1990s, with guest roles in Charles in Charge, Who's the Boss?, and the short-lived What a Dummy. In 1993, he portrayed Brandon Collins on the soap opera The Young and the Restless; he and co-star Heather Tom, who played Victoria Newman, gained fame, and were nominated for Outstanding Lead Actor and Actress in a Soap Opera at the Youth in Film Awards. Walker's final television role was on Touched by an Angel, although appeared as himself, alongside his sister Ashlie, as contestants on a 1988 episode of the game show I'm Telling!, in which they finished in second place. Walker began his film career in 1986, appearing mainly in low budget B films. His first role was in the horror comedy Monster in the Closet, and a year later, starred The Retaliator , a science fiction film. In 1994, he returned to film, starring in Tammy and the T-Rex, but secured his first feature film role in the comedy Meet the Deedles in 1998; although commercially and critically unsuccessful, it allowed Walker to secure supporting roles in the films Pleasantville , Varsity Blues , She's All That , and The Skulls . In 2001, Walker's breakthrough role arrived when he starred opposite Vin Diesel in the action film The Fast and the Furious; it was commercially successful, and subsequently launched a media franchise. The film also established Walker as a film star and leading man, as his performance garnered the MTV Movie Award for Best On-Screen Team in 2002. Walker then reprised his role as Brian O'Conner in the 2003 sequel 2 Fast 2 Furious, and also starred in the critically successful thriller Joy Ride . After this, Walker starred mainly in either low-budget or commercially unsuccessful films, notably Timeline and Into the Blue . Walker had a supporting role, portraying Hank Hansen Clint Eastwood's war film Flags of Our Fathers , and starred in the survival drama Eight Below, both released in 2006. Eight Below garnered critical acclaim and opened in first place at the box office, grossing over US$20 million during its opening weekend. Walker then starred in the independent film The Lazarus Project, which was released on DVD on October 21, 2008. Despite initial reluctance, Walker reprised his role as Brian O'Conner after seven years, in Fast & Furious . The film became the highest-grossing film in the franchise up until that point. He reprised his role in the fifth and sixth installments of the franchise, which were commercially successful, while his performances were praised. Walker was nominated for Choice Movie Actor – Action at the 2011 Teen Choice Awards for the former, and nominated for Choice Movie: Chemistry and won his second MTV Movie Award for Best On-Screen Duo with Diesel for the latter. Walker also starred in the heist film Takers , and returned to modelling in 2011, appearing as the face of fragrance brand Cool Water. In 2012, he founded the film production company Laguna Ridge Pictures, which signed a first-look deal with Fast & Furious distributor Universal Pictures.After his death in 2013, four films starring Walker were released; the thriller film Hours , the action film Brick Mansions , itself a remake of the French film District 13 . He also acted as executive producer on the film Pawn Shop Chronicles , while Furious 7, originally slated for release in 2014, was pushed back to recreate Walker's likeness. The filmmakers hired Peter Jackson's Weta Digital visual effects house to complete this, using existing reference materials, Walker's brothers Caleb and Cody, as well as actor John Brotherton, as stand-ins, and outtakes or older footage, to create an accurate remodel of Walker's face. The film was then released in 2015, and Walker won the award for Choice Movie Actor: Action at the 2015 Teen Choice Awards, and was nominated for Choice Movie: Chemistry . Walker was also set to play Agent 47 in the film adaptation Hitman: Agent 47 , but died before production began. It was later revealed Walker declined the role of Superman in Superman Returns , allegedly due to the Superman curse and the celebrity associated with the role. Walker was raised in a Mormon household, but later became a non-denominational Christian. He lived in Santa Barbara with his dogs. He and Rebecca Soteros, a one-time girlfriend, had a daughter named Meadow Rain Walker, who lived with her mother in Hawaii for 13 years and then moved to California to live with Walker in 2011. Her godfather is Vin Diesel, with whom Walker shared a close bond; Diesel gave him the nickname \"Pablo\", while Walker's mother referred to her son as Diesel's \"other half\". Walker was also close friends with fellow Fast & Furious co-star Tyrese Gibson. At the time of his death, Walker was dating Jasmine Pilchard-Gosnell.He held a brown belt in Brazilian jiu-jitsu under Ricardo \"Franjinha\" Miller at Paragon Jiu-Jitsu and was awarded his black belt by Miller posthumously. Walker founded the humanitarian aid nonprofit charity Reach Out Worldwide with financial adviser Roger Rodas in response to the 2010 Haiti earthquake. He traveled to a number of disaster-stricken areas to supply aid until his death. Walker had an interest in marine biology, and joined the board of directors of The Billfish Foundation in 2006. He fulfilled a lifelong dream by starring in the National Geographic Channel series Expedition Great White , which premiered in June 2010. Walker spent 11 days catching and tagging seven great white sharks off the coast of Mexico. The expedition, led by Chris Fischer, founder and CEO of Fischer Productions, and Brett McBride and Michael Domeier of the Marine Conservation Science Institute, took measurements, gathered DNA samples, and fastened real-time satellite tags to the great white sharks, in order to study migratory patterns, especially those associated with mating and birthing, over a five-year period.A car enthusiast, Walker competed in the Redline Time Attack racing series in which he raced on the AE Performance Team driving a BMW E92 M3. His car was sponsored by Etnies, Brembo Brakes, Öhlins, Volk, OS Giken, Hankook, Gintani, and Reach Out Worldwide. Walker had been preparing for an auto show prior to his death. Walker owned Always Evolving, a Valencia high-end vehicle performance shop, where Rodas, a pro-am racer, acted as CEO.Walker also had a large car collection of about 30 cars, a portion of which he co-owned along with Rodas. The collection included : In January 2020, twenty-one vehicles owned by Walker were sold for a combined $2.33 million during spirited bidding at an annual car auction in Arizona. On November 30, 2013, at about 3:30 p.m. PST, Walker, 40, and Roger Rodas, 38, left an event for Walker's charity Reach Out Worldwide for victims of Typhoon Haiyan , with Rodas driving his 2005 Porsche Carrera GT. In a 45 mph speed zone on Hercules Street near Kelly Johnson Parkway in Valencia, Santa Clarita, California, the car crashed into a concrete lamp post and two trees subsequently catching fire to the vehicle. Rodas died of multiple trauma while Walker died from the combined effects of trauma and burns. Both of their bodies were burned beyond recognition.The curve where Walker and Rodas died is a popular spot for drifting cars. No alcohol or other drugs were found in either man's system, and neither mechanical failure nor road conditions appeared to play a role. Police found no evidence of drag racing. The investigation concluded that the car's speed – between 80 mph and 93 mph – and age of the tires were the primary reasons for the crash. With Furious 7 in the middle of filming at the time of Walker's death, Universal announced an indeterminate hiatus on the production, citing a desire to speak with his family before determining what to do with the film.Numerous friends and movie stars posted tributes to Walker on social media. His body was cremated and his ashes were buried in a non-denominational ceremony at Forest Lawn Memorial Park. His life was later chronicled in the documentary I Am Paul Walker, which was released on August 11, 2018. In December 2014, Walker's father filed a wrongful death claim against Rodas' estate seeking the return of or \"a proportionate share\" of revenue generated by a group of automobiles that were jointly owned by both Walker and Rodas. In September 2015, Walker's daughter filed a wrongful death lawsuit against Porsche, claiming that the Porsche Carrera GT had numerous design defects including a history of instability, and that its seat belt placement can cause harm upon impact. However, Porsche denied any wrongdoing and blamed Walker, stating: \"The perils, risk, and danger were open and obvious and known to him, and he chose to conduct himself in a manner so as to expose himself to such perils, dangers, and risks, thus assuming all the risks involved in using the vehicle.\"In April 2016, U.S. District Court Judge Philip S. Gutierrez ruled in favor of Porsche in a separate lawsuit filed by Rodas' widow Kristine. The ruling had no bearing on two other cases against Porsche which have been filed by Walker's father, who is also the executor of the actor's estate, and his daughter. Walker's father and daughter both reached separate out-of-court settlements with Porsche. Paul Walker at IMDb Paul Walker at AllMovie","sentences":[{"text":"Paul William Walker IV was an American actor.","keywords":["Paul William Walker IV","American actor"],"images":[]},{"text":"He is best known for his role as Brian O'Conner in the Fast & Furious franchise.","keywords":["Brian O'Conner","role","Furious franchise"],"images":[]},{"text":"Walker began his career as a child actor during the 1970s and 1980s, gaining recognition in the early 1990s after appearing in the television soap opera The Young and the Restless; he received praise for his performances in the teen film She's All That and the coming-of-age film Varsity Blues , before gaining international fame after starring in The Fast and the Furious .","keywords":["television soap opera","child actor","teen film","early 1990s","age film Varsity Blues","international fame","Walker","career","recognition","praise","performances","1980s","1970s","Young","Restless","coming"],"images":[]},{"text":"Walker then starred in the commercially successful road thriller Joy Ride , which led to a reputation as an action star.","keywords":["successful road thriller Joy Ride","action star","Walker","reputation"],"images":[]},{"text":"He then continued with his performances in box-office disappointments Into the Blue and Running Scared .","keywords":["box-office disappointments","performances","Running Scared","Blue"],"images":[]},{"text":"Walker also earned praise in other genres, like in the survival drama Eight Below, and for his portrayal of Hank Hansen the war film Flags of Our Fathers .","keywords":["survival drama","portrayal of Hank Hansen","Walker","praise","genres","war film Flags of Our Fathers"],"images":[]},{"text":"Outside of these, Walker then largely appeared in low budget action films, but starred in the commercially successful heist film Takers .","keywords":["low budget action films","Walker","successful heist film Takers"],"images":[]}]}